[
  {
    "id": "insight_1767709683793_9bbo1powu",
    "title": "A PROLONGED PERIOD IN REMAND AS A MITIGATING FACTOR IN KENYAN SENTENCING.",
    "excerpt": "Kenyan courts must deduct pre-trial remand time from final sentences under Section 333(2) of the Criminal Procedure Code to ensure proportional and lawful punishment.",
    "body": "<p>After both sides in a criminal trial have closed their cases, the court will proceed to render a judgment.</p><p>If the court delivers a guilty verdict in its judgment, it will proceed to sentencing. Sentencing is perhaps the most challenging part of the criminal trial process.&nbsp;It’s the last stage in determining the fate of the accused.</p><p>Sentencing achieves the overall goals of the criminal justice system. These goals include punishment, deterrence, rehabilitation, and separating offenders from society where necessary.</p><p>Sentencing in Kenya is governed by <em>Sections 329–333 of the Criminal Procedure Code</em>, with additional guidance drawn from constitutional principles, the Penal Code, judicial precedent and the Judiciary Sentencing Guidelines. Former Chief Justice Willy Mutunga launched the sentencing guidelines in January 2016.They were meant to bring consistency, accountability, equity and transparency in sentencing.</p><p>Every case is unique and peculiar in its own way, and a court considers the specific circumstances that can lessen the impending sentence. This is called mitigation. This ensures that the punishment fits the crime.</p><p>The duration the accused has spent in custody during the trial process is one of the mitigating factors.&nbsp;The dire situation in Kenya’s criminal justice system is that accused persons sometimes spend a considerable duration in remand. This is often as a result of being unable to meet the bail and bond requirements.</p><p><em>Section 333(2) of the Criminal Procedure Code</em> requires the court to take into account the time spent in custody when delivering a sentence. A plain interpretation of the section implies that, assuming the accused had already spent five years in remand for a charge that attracts a punishment of 15 years' imprisonment, the court will pass a sentence of ten years' imprisonment. It takes into account the date the accused’s detention began.</p><p>In the case of&nbsp;<a href=\"https://new.kenyalaw.org/akn/ke/judgment/kehc/2006/1448/eng@2006-06-13\" rel=\"noopener noreferrer\" target=\"_blank\">Republic V Peter Kimondiu Mutungi [2006]&nbsp;Kehc&nbsp;1448&nbsp;(Klr)</a>, the court considered the period the accused had spent in remand as part of the mitigating factors in passing its sentence. The accused, who had assaulted the deceased, had already spent five years in remand during the trial. The court sentenced the accused to 15 months' imprisonment.</p><p>In&nbsp;the case of&nbsp;<a href=\"https://new.kenyalaw.org/akn/ke/judgment/keca/2018/743/eng@2018-01-26\" rel=\"noopener noreferrer\" target=\"_blank\">Ahamad Abolfathi Mohammed &amp; another v Republic [2018] eKLR</a>, the Court of Appeal&nbsp;held that Section 333(2) of the Criminal Procedure Code, which was introduced in 2007, is meant to give the court power to include the period already spent in custody in the sentence that it metes out to the accused person.</p><p>In conclusion, a court that fails to take into account the period an accused person has spent in custody&nbsp;misdirects itself&nbsp;and risks imposing an&nbsp;excessive and unlawful sentence. The duty to consider time spent in custody is mandatory and goes to the legality and proportionality of the sentence imposed. An accused person should therefore raise this issue&nbsp;at the earliest opportunity, preferably at mitigation or sentencing, to enable the court to properly exercise its discretion and ensure that the sentence reflects the total period already served.</p>",
    "image": "blob:https://law-firm-website-kappa.vercel.app/5d0cc508-1270-4c99-b988-481762633dab",
    "slug": "a-prolonged-period-in-remand-as-a-mitigating-factor-in-kenyan-sentencing",
    "date": "2026-01-06",
    "featured": true,
    "status": "published",
    "createdAt": "2026-01-06T14:28:03.794Z",
    "updatedAt": "2026-01-08T10:39:38.994Z",
    "url": "/api/insight-page?slug=a-prolonged-period-in-remand-as-a-mitigating-factor-in-kenyan-sentencing"
  }
]